Feature: Оценяване на бижута

    Background:
        Given Потребителя отваря детайлите на "Diamond Ring"

    Scenario: Успешно оценяване на бижуто
        When избира 1 звезда
        And Въвежда коментар "бижуто е страхотно"
        And Натиска бутона оцени
        Then Вижда съобщение "Успешно оценихте с 1 звезда бижуто Diamond Ring"

    Scenario: Успешно оценяване на бижуто без коментар
        When избира 1 звезда
        And Натиска бутона оцени
        Then Вижда съобщение "Успешно оценихте с 1 звезда бижуто Diamond Ring"

    Scenario: Успешно оценяване на бижуто без оценка
        When Въвежда коментар "бижуто е страхотно"
        And Натиска бутона оцени
        Then Вижда съобщение "Въведете оценка"

    Scenario: Успешно оценяване на бижуто с коментар с дължина над 50
        When избира 1 звезда
        And Въвежда коментар "бижуто е страхотно1234567890123456789012345678901234567890"
        And Натиска бутона оцени
        Then Вижда съобщение "Коментара трябва да е с дължина под 51"

    Scenario: Успешно оценяване на бижуто с коментар със забранени символи
        When избира 1 звезда
        And Въвежда коментар "бижуто е страхотно!;$>"
        And Натиска бутона оцени
        Then Вижда съобщение "За коментари може да ползвате букви, цифри и '.,!-'"

