Feature: Визуализиране на налични бижута

Background: Отваряне на приложението
Given отваряне на приложението

Scenario: Отваряне на начален екран с налични бижута
Then Визуализира се списък с категории
And Визуализира списък с наличните 3 бижута

Scenario: Отваряне на начален екран с бижута с избор на категория
When потребителя избере категория: "Rings"
Then Визуализира списък с наличните 1 бижута



Scenario Outline: Отваряне на начален екран с бижута с търсене по име на бижуто
When потребителя въвежда име на бижуто <име> в полето за търсене
And натиска бутона за търсене
Then Визуализира списък с наличните <брой> бижута


Examples:
| име       | брой |
| "Ring"    | 5 |
| ""        | 6 |
| " "       | 6 |
| "()!@*()" | 0 |